<template>
  <div v-if="looplist">电影详情id:{{$route.params.myid}}
        <div>
            <h2>豆瓣评分：{{looplist[$route.params.myid].grade}}分</h2>
            <p>{{looplist[$route.params.myid].title}}</p>
            <img :src="looplist[$route.params.myid].url" >
            <p>{{looplist[$route.params.myid].text}}</p>
        </div>
  </div>
</template>

<script>
export default {
  asyncData() {
      return {
        looplist:[
            {
                "title":"那一夜，我给你开过车",
                "url":"https://p0.meituan.net/movie/48774506dc0e68805bc25d2cd087d1024316392.jpg@160w_220h_1e_1c",
                "grade":"9",
                "text":"那一夜，我给你开过车。2001年的某一天，刚刚考上大学的贾晓玲（贾玲 饰）经历了人生中的一次大起大落。一心想要成为母亲骄傲的她却因母亲突遭严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 饰）相遇，二人形影不离，宛如闺蜜。与此同时，也结识了一群天真善良的好朋友。晓玲以为来到了这片“广阔天地”，她可以凭借自己超前的思维，让母亲“大有作为”，但结果却让晓玲感到意外......"
            },
            {
                "title":"拿摩一等",
                "url":"https://p0.meituan.net/movie/8a1ad4ec0d81f240e4d8c2d1b10c2ec53475644.jpg@160w_220h_1e_1c",
                "grade":"8.6",
                "text":"拿摩一等。烈安利，比小品还要精彩完整，前面笑的不行，后面被感动的稀里哗啦。本以为是贾玲穿越回去想尽办法让焕英高兴，却还是母亲继续默默关心疼爱，那一瞬间，电影院的一个哥哥突然大哭，整个影院都在感动，太真挚感人，真实的故事更让我们感动和震撼，我们母亲需要的不是我们光宗耀祖，而是我们平平安安，快乐健康。强烈推荐，太棒了贾玲，你妈妈一定会为你骄傲，她作为你的母亲很快乐。沈腾、陈赫等喜剧演员的加入，让故事更精彩更搞笑，期待你们更好的电 饰）经历了人生中的一次大起大落。一心想要成为母亲骄傲的她却因母亲突遭严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 饰）相遇，二人形影不离，宛如闺蜜。与此同时，也结识了一群天真善良的好朋友。晓玲以为来到了这片“广阔天地”，她可以凭借自己超前的思维，让母亲“大有作为”，但结果却让晓玲感到意外......"
            },
            {
                "title":"桌球少女",
                "url":"https://p1.meituan.net/movie/ece9ff81e6f0af2c859aa151e42a33312706648.jpg@160w_220h_1e_1c",
                "grade":"8.1",
                "text":"桌球少女。李焕英（张小斐 给我整湿了两张纸巾一个口罩，前面笑的多开心后面的泪水就有多少，没多带几张纸巾和几个口罩就是你失算了。 正是因为知道了贾玲的母亲真的不在了，看电影的时候就特别触动，哭的直抽抽，眼泪不停掉。个人认为电影整体非常非常完美，真的很好笑也很好哭。无论是那句“人在不服输的时候从来都是有光彩的”还是母亲的平凡而对女儿来说的伟大，都是值得我早上七点起......"
            },
            {
                "title":"反贪风暴4",
                "url":"https://p0.meituan.net/movie/9ef2f7d8d6f11c55723d7be5fa77218d1022103.jpg@160w_220h_1e_1c",
                "grade":"7.8",
                "text":"反贪风暴4。她却因母亲突遭严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 的大部分都是喜剧氛围，非常搞笑，每一个笑点都处理得很好，不显得尴尬。升华的触动人心的部分也处理的恰到好处，细节拿捏的非常恰当，整部电影的处理令人感到极度舒适。 作为导演的贾玲将自己对生命最诚挚的感悟和对母亲的深切怀念都放在这部电影里了，剧本很扎实，镜头语言也稳定，加上真情实感在里面，电影《你好，李焕英》简直无敌。它有太多值得夸的点了。作为新星的女性导演，贾玲的这部作品的确让我对她刮目相看。 母爱其实并不好拍，因为谁都有妈，想让人哭太容易了，但是很多作品哭完之后走出影院回头想想，就好像自己被骗了，像是被化学制品催泪了，创作者与观众一起落入过度煽情的大坑。而李焕英完全不会，它并不着力于母亲是如何无私奉献，点燃自己照亮儿女。它轻盈有趣又真挚感人。它将母爱诠释的恰到好处。穿越剧是老题材了，......"
            },
            {
                "title":"雪暴",
                "url":"https://p0.meituan.net/moviemachine/778ef027d0fe90fd27448d8369d4cf9e2820477.jpg@160w_220h_1e_1c",
                "grade":"7",
                "text":"雪暴。严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 哭又治愈。和闺蜜看的，其实我一开头就哭了，调皮的女儿闯了祸，中年的母亲去学校见老师，像极了我幼儿园、小学时期闯了祸，爸妈来学校的样子。。。更别提后面的诸多泪点了。母亲说出那句:“我的女儿，只要她健康快乐就行了（大概）”我哭惨了。结尾发现母亲和女儿一样来自现代，知道女儿是来让自己开心的，并一直努力配合着女儿，就像两人一起做了一场梦，以及最后晓玲开着敞篷车，镜头最开始是副驾驶坐着母亲，晓玲意气风发的说些什么，母亲也笑着回答，看向晓玲的眼神里都是骄傲，镜头慢慢转到车子的侧边，只剩晓玲一个人开着车，行驶在盘山公路上。子欲养而亲不待。我从未让你骄傲，你却视我为骄傲。看片过程中我不断想到这......"
            },
            {
                "title":"中国机长",
                "url":"https://p0.meituan.net/moviemachine/6766681dc599e1964e9acbf86391207377187.jpg@160w_220h_1e_1c",
                "grade":"6.6",
                "text":"中国机长。人生中的一次大起大落。一心想要成为母亲骄傲的她却因母亲突遭严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 尽自己一切努力帮助母亲能够弥补曾经的遗憾 事实上，母亲自始至终都是最明白的一个人 李焕英正好被贾玲砸中，是因为掉下来的是她的女儿 那句“我宝”， 后来贾玲帮助母亲抢到电视，别人问她表妹来干啥来了，李焕英说“让我高兴来了” 还有排球比赛那里“晓玲的妈妈以前是排球队队员，现在可能已经不在了”李焕英明白女儿做的一切是在弥补她的遗憾 还有就是贾玲喝醉后，李焕英背着女儿往家走“下辈子，还是我当妈” 整片电影前期看似为了搞笑而搞笑的剧情，全是伏笔，看过反转后每次想起来前面的剧情就会忍不住想流泪 贾玲真的将所有心血都用在这部电影上，也可以看出每一个细节，都是在告诉我们她的母亲到底是有多么爱她。 最后的最后，贾......"
            },
            {
                "title":"那年八岁",
                "url":"https://p0.meituan.net/movie/72291e1cbc83311656e01e828ca79ddd2106074.jpg@160w_220h_1e_1c",
                "grade":"6.3",
                "text":"那年八岁。严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 见解—— 1.这个故事是李焕英弥留之际的梦境，梦到自己回到二十岁的时候，女儿也一起跟着穿越过来并帮她改变人生(所以贾玲没有变化，而李焕英变年轻） 2.冷特这个角色是李焕英心目中贾玲的归宿，跟贾玲一样对母亲心怀愧疚，可以理解她的心情，而且在贾玲需要帮助时能给予她安慰和帮助（冷特的出现也说明了这是妈妈的梦，因为冷特这个角色基本上只跟贾玲互动，贾玲也不可能平白无故幻想出一个喜欢自己的男生，也只有妈妈想要有人疼你） 3.结尾是贾玲开着桑塔纳的敞篷车载着穿着绿色皮衣的老年李焕英，车牌HY1012（开头贾玲就说以后有钱给妈妈买小轿车，嫌闷就买敞篷的，车牌HY就是妈妈的名字缩写，而皮衣就是送妈妈的礼物不合身，还没......"
            },
            {
                "title":"大约在冬季",
                "url":"https://p0.meituan.net/movie/12b0e9d3c645cda41a9c787066d52279388947.jpg@160w_220h_1e_1c",
                "grade":"4.5",
                "text":"大约在冬季。她却因母亲突遭严重意外，而悲痛万分。在贾晓玲情绪崩溃的状态下，竟意外的回到了 1981 年，并与年轻的母亲李焕英（张小斐 反复的想起那句话，我来了，你开心吗。我开心啊！还有在晓玲和焕英在争论中不小心撕坏了结婚证的时候，焕英哭着对晓玲说，这辈子我过得很幸福，你怎么就不相信呢。这大概就是在已经挽回不了自己生命的另一个时空，她想告诉她，又告诉不了她的事，在这里告诉她，陪伴她，陪她一场开心，让她安心，不要悔恨。看完一场，我觉......"
            }
        ]
      }
  },
}
</script>

<style>

</style>